tangguocheng/stm32f10x/RCU_YN/src/task/task_485.c
                        receive_idx = get_avalid_frame(protocol_data_receive,RECV_FRAME_LEN);
                }

        }
}

static u8 key_disable_0x11 = 0;
static u8 key_disable_0x12 = 0;
static u8 key_disable_0x13 = 0;
static u8 key_disable_0x14 = 0;
static u8 key_disable_0x15 = 0;
static u8 key_disable_0x16 = 0;

#define KEY_0x12    BIT1
#define KEY_0x14    BIT2
#define KEY_wkq     BIT3
void gpio_input_process(void)
{
        static u8 first = 1;
        static u8 last_PD12 = 3,last_PA4 = 3,last_PA5 = 3;
        u8 PD12 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12);
        u8 PA4 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_4);
        u8 PA5 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5);
        u8 PA7 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_7);
        BaseType_t rtl = pdFALSE;

        if (first) {
                first = 0;
                last_PD12 = PD12;last_PA4 = PA4;last_PA5 = PA5;
                return;
        }

        static u16 delay_off_time_D12 = 0;
        static u8 start_delay_D12 = 0;

        if (PD12 != last_PD12) {
                last_PD12 = PD12;
                if ( PD12 == Bit_RESET ) {
                        RL_ON(1);RL_ON(2);RL_ON(9);RL_ON(10);
                        GPIO_SetBits(GPIOE,GPIO_Pin_0);
                        RL_ON(14);RL_ON(16);
                        start_delay_D12 = BIT1;
                        delay_off_time_D12 = 2000;
                        
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd8;
                        data_01 |= BIT2;
                        data_03 |= (BIT1 | BIT2);
                        data_05 |= BIT2;
                        
                        protocol_data[2] = data_01;
                        protocol_data[3] = data_02;
                        protocol_data[4] = data_03;
                        protocol_data[5] = data_04;
                        protocol_data[6] = data_05;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;

                        protocol_data_wait_sent[idx].data_len = 8;
                        void* ptr = &protocol_data_wait_sent[idx];
                        rtl = send_queue_item(1,ptr);
                        
                        idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd9;
                        data_06 |= BIT1;                      
                        protocol_data[1] = data_06;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;

                        protocol_data_wait_sent[idx].data_len = 8;
                        ptr = &protocol_data_wait_sent[idx];
                        rtl = send_queue_item(1,ptr);
                        
                        key_disable_0x11 = 0;
                        key_disable_0x12 = 0;
                        key_disable_0x13 = 0;
                        key_disable_0x14 = 0;
                        key_disable_0x15 = 0;
                        key_disable_0x16 = 0;
                } else if (PD12 == Bit_SET) {
                        start_delay_D12 = BIT2;
                        delay_off_time_D12 = 60000;
                        RL_OFF(14);RL_OFF(15);RL_OFF(16);RL_OFF(17);
                }
        }

        if (delay_off_time_D12)
                delay_off_time_D12--;
        
        if ((delay_off_time_D12 == 58000) && (start_delay_D12 == BIT2)) {
                RL_ON(15);RL_ON(17);      
        } else if ((delay_off_time_D12 == 56000) && (start_delay_D12 == BIT2)) {
                RL_OFF(15);RL_OFF(17);
        }
                
        if ((start_delay_D12 != 0) && (delay_off_time_D12 == 0)) {
                if (start_delay_D12 == BIT1) {
                        RL_OFF(14);RL_OFF(16);
                        start_delay_D12 = 0;
                } else if (start_delay_D12 == BIT2){
                        RL_OFF(1);RL_OFF(6);RL_OFF(10);
                        RL_OFF(2);RL_OFF(7);RL_OFF(11);
                        RL_OFF(3);RL_OFF(8);RL_OFF(12);
                        RL_OFF(4);RL_OFF(9);RL_OFF(13);
                        RL_OFF(5);GPIO_ResetBits(GPIOE,GPIO_Pin_0);
                       
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd8;
                        data_01 &= ~BIT2;
                        data_02 &= ~(BIT1 | BIT2 | BIT3);
                        data_03 &= ~(BIT1 | BIT2 | BIT3);
                        data_04 &= ~(BIT1 | BIT2 | BIT3);
                        data_05 &= ~(BIT1 | BIT2 | BIT3);
                        
                        protocol_data[2] = data_01;
                        protocol_data[3] = data_02;
                        protocol_data[4] = data_03;
                        protocol_data[5] = data_04;
                        protocol_data[6] = data_05;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;

                        protocol_data_wait_sent[idx].data_len = 8;
                        void* ptr = &protocol_data_wait_sent[idx];
                        rtl = send_queue_item(1,ptr);
                        
                        idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd9;
                        data_06 &= ~(BIT1 | BIT2);                      
                        protocol_data[1] = data_06;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;

