tangguocheng/stm32f10x/RCU_YN/src/task/task_485.c
                        protocol_data_wait_sent[idx].data_len = 8;
                        ptr = &protocol_data_wait_sent[idx];
                        rtl = send_queue_item(1,ptr);
                        
                        key_disable_0x11 |= BIT2;
                        key_disable_0x12 |= (BIT1 | BIT2 | BIT3);
                        key_disable_0x13 |= (BIT1 | BIT2 | BIT3);
                        key_disable_0x14 |= (BIT1 | BIT2 | BIT3);
                        key_disable_0x15 |= (BIT1 | BIT2 | BIT3);
                        key_disable_0x16 |= (BIT1 | BIT2);
                }              
        }


        static u16 delay_off_time_A4 = 0;
        static u8 start_delay_A4 = 0;
        if ((PA4 != last_PA4)) {
                last_PA4 = PA4;
                if ( (PD12 == Bit_SET) && (PA4 == Bit_RESET)) {
                        start_delay_A4 = 1;
                        delay_off_time_A4 = 60000;
                        RL_ON(2);
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd8;
                        data_01 |= BIT2;
                        protocol_data[2] = data_01;
                        protocol_data[3] = data_02;
                        protocol_data[4] = data_03;
                        protocol_data[5] = data_04;
                        protocol_data[6] = data_05;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                        protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                        protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;
                        void* ptr = &protocol_data_wait_sent[idx];
                        rtl = send_queue_item(1,ptr);
                }
        }

        if (delay_off_time_A4)
                delay_off_time_A4--;

        if ((start_delay_A4 == 1) && (delay_off_time_A4 == 0)) {
                start_delay_A4 = 0;
                RL_OFF(2);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                data_01 &= (~BIT2);
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;
                void* ptr = &protocol_data_wait_sent[idx];
                rtl = send_queue_item(1,ptr);
        }

        static u8 start_delay_A5 = 0;
        static u16 delay_off_time_A5 = 0;

        if (PD12 == Bit_RESET)
                PA5_enable = 1;
        else if (PD12 == Bit_SET)
                PA5_enable = 0;
                
        if ((PA5 != last_PA5) && PA5_enable) {
                last_PA5 = PA5;
                if ( PA5 == Bit_RESET ) {
                        start_delay_A5 = 1;
                        delay_off_time_A5 = 2000;
                        IO_OUTPUT9_ON();
                }
        }

        if (delay_off_time_A5)
                delay_off_time_A5--;

        if ((start_delay_A5 == 1) && (delay_off_time_A5 == 0)) {
                start_delay_A5 = 0;
                IO_OUTPUT9_OFF();
        }

        portYIELD_FROM_ISR(rtl);
}

static u16 delay_cnt = 0;
void task_485_poll(void* param)
{
        (void)param;
        while(1) {
                vTaskDelay(10 / portTICK_PERIOD_MS);
                delay_cnt++;
                
                if ((delay_cnt % 3) == 0) {
                        current_protocol = SHANGHUI_PROTOCOL;
                        device_poll();
                } 
//                else
//                if (delay_cnt == 200) {
//                        current_protocol = WK8001_PROTOCOL;
//                        device_poll();
//                        vTaskDelay(90 / portTICK_PERIOD_MS);
//                        delay_cnt = 0;
//                }      
        }
}

void key_0x11(u8 rx_data)
{
        rx_data &= (~key_disable_0x11);
        if (rx_data & BIT1) { 
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_1 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_1) : GPIO_SetBits(GPIOE,GPIO_Pin_1));
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_2 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_2) : GPIO_SetBits(GPIOE,GPIO_Pin_2));

                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                if (GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_1 )  == Bit_RESET) {
                        data_01 &= (~BIT1);
                } else {
                        GPIO_ResetBits(GPIOE,GPIO_Pin_3);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_4);        
                        data_01 &= (~BIT3);
                        data_01 |= BIT1;
                }
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }

        if (rx_data & BIT2) {
                RL_TOGGLE(2);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                data_01 = (RL_STATE(2) ? data_01 | BIT2 : data_01 & (~BIT2));
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }

        if (rx_data & BIT3) { 
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_3 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_3) : GPIO_SetBits(GPIOE,GPIO_Pin_3));
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_4 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_4) : GPIO_SetBits(GPIOE,GPIO_Pin_4));
                if (GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_3 ) == Bit_SET) {
                        PA5_enable = 0;
                        data_01 |= BIT3;
                        data_01 &= (~BIT1);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_1);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_2);
                } else {
                        PA5_enable = 1;
                        data_01 &= (~BIT3);
                }

                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
}

