tangguocheng/stm32f10x/RCU_YN/src/task/task_485.c
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT2) {
                RL_OFF(2);RL_OFF(3);RL_OFF(4);RL_OFF(5);
                RL_OFF(7);RL_OFF(8);RL_OFF(9);RL_OFF(10);
                RL_OFF(11);RL_OFF(12);RL_OFF(13);
                RL_ON(6);
                cozy_state_word = 0;
                RL_ON(15);RL_ON(17);

                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                
                data_01 &= (~BIT2);
                data_02 &= (~(BIT1 | BIT2 | BIT3));
                data_03 &= (~(BIT1 | BIT2 | BIT3));
                data_04 |= BIT1 | BIT2;
                
                data_04 &= (~BIT3);
                data_05 &= (~(BIT1 | BIT2 | BIT3));
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
                
                idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd9;
                data_06 &= (~(BIT1 | BIT2));                    
                protocol_data[1] = data_06;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                protocol_data[6] ;

                protocol_data_wait_sent[idx].data_len = 8;
                ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
                
                key_0x14_delay_flag = BIT1;
                key_0x14_delay_time = 10000;
        }
        
        if (rx_data & BIT3) {
               
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;

                if (cozy_state_word == 0) {
                        RL_ON(9);RL_ON(10);
                        RL_OFF(2);RL_OFF(7);RL_OFF(8);
                        RL_OFF(6);RL_OFF(11);RL_OFF(12);
                        RL_OFF(13);
                        cozy_state_word = 1;
                        data_01 &= (~BIT2);
                        data_03 &= (~(BIT1 | BIT3));
                        data_03 |= BIT2;
                        data_04 &= (~(BIT1 | BIT2));
                        data_04 |= BIT3;
                        data_05 &= (~(BIT1 | BIT3));
                        data_05 |= BIT2;
                        data_06 |= BIT2;
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd9;
                        protocol_data[1] = data_06;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;                                                                                             
                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(0,ptr);
                        RL_ON(15);RL_ON(17);
                        key_0x14_delay_flag = BIT2;
                        key_0x14_delay_time = 2000;
                } else {
                        cozy_state_word = 0;
                        RL_OFF(8);RL_OFF(9);RL_OFF(10);
                        data_03 &= (~BIT2);
                        data_04 &= (~BIT3);
                        data_05 &= (~BIT2);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);   
        }
}

void key_0x15(u8 rx_data)
{
        rx_data &= (~key_disable_0x15);
        if (rx_data & BIT1) {
                RL_TOGGLE(7);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                if (RL_STATE(7)) {
                        data_05 |= BIT1;
                } else {
                        data_05 &= (~BIT1);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

