tangguocheng/stm32f10x/RCU_YN/src/task/task_485.c
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT2) {
                RL_TOGGLE(9);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                if (RL_STATE(9)) {
                        data_05 |= BIT2;
                } else {
                        data_05 &= (~BIT2);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT3) {
                RL_TOGGLE(8);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                if (RL_STATE(8)) {
                        data_05 |= BIT3;
                } else {
                        data_05 &= (~BIT3);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
}


static u8 key_0x16_delay_flag = 0;
static u16 key_0x16_delay_time = 0;
static u8 key_0x16_delay_start = 0;
void key_0x16_delay_proc(void)
{
        if (key_0x16_delay_time) {
                key_0x16_delay_start = 1;
                key_0x16_delay_time--;
        }
        
        if ((key_0x16_delay_time == 8000) && (key_0x16_delay_flag == BIT1)) {
                 RL_OFF(14);
        }
        
        if ((key_0x16_delay_time == 8000) && (key_0x16_delay_flag == BIT2)) {
                 RL_OFF(15);
        }
        
        if (key_0x16_delay_time == 0 && key_0x16_delay_start == 1) {
                key_0x16_delay_start = 0;
                if (key_0x16_delay_flag == BIT1) {
                        key_0x16_delay_flag = 0;
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd9;

                        data_06 &= (~BIT1);

                        protocol_data[1] = data_06;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;                                                   

                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(1,ptr);
                }
                
                if (key_0x16_delay_flag == BIT2) {
                        key_0x16_delay_flag = 0;
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd9;

                        data_06 &= (~BIT2);

                        protocol_data[1] = data_06;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;                                                   

                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(1,ptr);
                }
        }
}

void key_0x16(u8 rx_data)
{
        rx_data &= (~key_disable_0x16);
        if (rx_data & BIT1) {
                RL_OFF(15); RL_ON(14);
                key_0x16_delay_time = 10000;
                key_0x16_delay_flag = BIT1;
                
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd9;
              
                data_06 |= BIT1;
                data_06 &= (~BIT2);

                protocol_data[1] = data_06;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

