tangguocheng/stm32f10x/RCU_YN/src/task/task_485.c
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT2) {
                RL_ON(15); RL_OFF(14);
                key_0x16_delay_time = 10000;
                key_0x16_delay_flag = BIT2;
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd9;
              
                data_06 |= BIT2;
                data_06 &= (~BIT1);
                
                protocol_data[1] = data_06;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }        
}

static u8 last_data3 = 4;
static u8 last_data45 = 3;
void wk8001_proc(u8* wk8001_data)
{
        if (wk8001_data[0] == 1)
                RL_ON(3);
        else if (wk8001_data[0] == 0) {
                RL_OFF(11);RL_OFF(12);RL_OFF(13);
        }

        if (last_data3 == 4)
                last_data3 = wk8001_data[3];
        else if (last_data3 != wk8001_data[3])
                wk8001_time_start = 0;

        if (wk8001_data[3] == 0) {                                           
                wk8001_time_cnt = 2000;
                wk8001_time_start |= BIT1;
        } else if (wk8001_data[3] == 1) {                                        
                wk8001_time_cnt = 2000;
                wk8001_time_start |= BIT2;
        } else if (wk8001_data[3] == 2) {                                        
                wk8001_time_cnt = 2000;
                wk8001_time_start |= BIT3;
        } else if (wk8001_data[3] == 3) {                                        
                wk8001_time_cnt = 2000;
                wk8001_time_start |= BIT4;
        }

        if (last_data3 == 4)
                last_data3 = wk8001_data[3];
        else if (last_data3 != wk8001_data[3]) {
                last_data3 = wk8001_data[3];
                wk8001_time_start = 0;
        }

        u8 data45 = 0;
        if (wk8001_data[4] == wk8001_data[5]) {
                wk8001_time_cnt_2 = 6000;
                wk8001_time_start_2 |= BIT1;
                data45 = 0;
        } else if (wk8001_data[4] > wk8001_data[5]) {                                        
                wk8001_time_cnt_2 = 6000;
                wk8001_time_start_2 |= BIT2;
                data45 = 1;
        } else if (wk8001_data[4] < wk8001_data[5]) {                                        
                wk8001_time_cnt_2 = 6000;
                wk8001_time_start_2 |= BIT3;
                data45 = 2;
        }

        if (last_data45 == 3)
                last_data45 = data45;
        else if (last_data45 != data45) {
                wk8001_time_start_2 = 0;
                last_data45 = data45;
        }
}

void task_485_receive(void* param)
{
        receive_485_queue = xQueueCreate(10, sizeof(struct portocol_data_frame *));
        while(1) {
                static struct portocol_data_frame *rx = NULL;
                if ( xQueueReceive(receive_485_queue, &rx, portMAX_DELAY) == pdTRUE ) {
                        if (rx->pro_id == SHANGHUI_PROTOCOL) {
                                switch (rx->data[0]) {
                                case 0x11:
                                       key_0x11(rx->data[1]);
                                        break;
                                case 0x12:
                                       key_0x12(rx->data[1]);
                                        break;
                                case 0x13:
                                       key_0x13(rx->data[1]);
                                        break;                                                                
                                case 0x14:
                                       key_0x14(rx->data[1]);
                                        break;
                                case 0x15:
                                       key_0x15(rx->data[1]);
                                        break;
                                case 0x16:
                                       key_0x16(rx->data[1]);
                                        break;
                                default:
                                        break;
                                }
                        } else if( rx->pro_id == WK8001_PROTOCOL) {                                       
                                if (rx->data[4] == 0x01) {
                                        update_wk_data(&rx->data[4]);
                                        wk8001_proc(&rx->data[5]);
                                }
                        }
                }
                
                rx->use = 0;
        }
}


void task_485_send(void* param)
{
        (void)param;
        send_485_queue = xQueueCreate(10, sizeof(struct portocol_data_frame *));
        while(1) {
                static struct portocol_data_frame *tx = NULL;
                if ( xQueueReceive(send_485_queue, &tx, portMAX_DELAY) == pdTRUE ) {
                       send_protocol_data(tx);
                }
        }
}

